# Tabula
https://medium.com/codestorm/how-to-read-and-scrape-data-from-pdf-file-using-python-2f2a2fe73ae7
https://nbviewer.org/github/chezou/tabula-py/blob/master/examples/tabula_example.ipynb

In [3]:
import tabula as tb
import pandas as pd
import numpy as np

In [4]:
file='https://population.un.org/wpp/Publications/Files/WPP2019_Highlights.pdf'
data = tb.read_pdf(file, pages='12')

In [5]:
type(data)
print(data)

[                          Unnamed: 0 Population (millions) Unnamed: 1  \
0                             Region                  2019       2030
1                              World                 7 713      8 548
2                 Sub-Saharan Africa                 1 066      1 400
3   Northern Africa and Western Asia                   517        609
4          Central and Southern Asia                 1 991      2 227
5     Eastern and South-Eastern Asia                 2 335      2 427
6    Latin America and the Caribbean                   648        706
7              Australia/New Zealand                    30         33
8                           Oceania*                    12         15
9        Europe and Northern America                 1 114      1 132
10                               NaN                   NaN        NaN
11         Least developed countries                 1 033      1 314
12  Land-locked Developing Countries                   521        659
13    Small Island Developing States                    71         78

   Unnamed: 2 Unnamed: 3
0        2050       2100
1       9 735     10 875
2       2 118      3 775
3         754        924
4       2 496      2 334
5       2 411      1 967
6         762        680
7          38         49
8          19         26
9       1 136      1 120
10        NaN        NaN
11      1 877      3 047
12        926      1 406
13         87         88  ]

In [6]:
df = pd.DataFrame(np.concatenate(data))

In [7]:
df.head(-1)

                                   0      1      2      3       4
0                             Region   2019   2030   2050    2100
1                              World  7 713  8 548  9 735  10 875
2                 Sub-Saharan Africa  1 066  1 400  2 118   3 775
3   Northern Africa and Western Asia    517    609    754     924
4          Central and Southern Asia  1 991  2 227  2 496   2 334
5     Eastern and South-Eastern Asia  2 335  2 427  2 411   1 967
6    Latin America and the Caribbean    648    706    762     680
7              Australia/New Zealand     30     33     38      49
8                           Oceania*     12     15     19      26
9        Europe and Northern America  1 114  1 132  1 136   1 120
10                               NaN    NaN    NaN    NaN     NaN
11         Least developed countries  1 033  1 314  1 877   3 047
12  Land-locked Developing Countries    521    659    926   1 406

In [24]:
df.dropna(inplace=True)
df.head()

                                  0      1      2      3       4
0                            Region   2019   2030   2050    2100
1                             World  7 713  8 548  9 735  10 875
2                Sub-Saharan Africa  1 066  1 400  2 118   3 775
3  Northern Africa and Western Asia    517    609    754     924
4         Central and Southern Asia  1 991  2 227  2 496   2 334

In [25]:
df.columns = df.iloc[0]
df.head()

0                            Region   2019   2030   2050    2100
0                            Region   2019   2030   2050    2100
1                             World  7 713  8 548  9 735  10 875
2                Sub-Saharan Africa  1 066  1 400  2 118   3 775
3  Northern Africa and Western Asia    517    609    754     924
4         Central and Southern Asia  1 991  2 227  2 496   2 334

In [8]:
 # drop linha do indice 0, que corresponde com cabecalho de colunas
df = df.drop(0)
df = df.reset_index(drop=True)

df.head()

                                  0      1      2      3       4
0                             World  7 713  8 548  9 735  10 875
1                Sub-Saharan Africa  1 066  1 400  2 118   3 775
2  Northern Africa and Western Asia    517    609    754     924
3         Central and Southern Asia  1 991  2 227  2 496   2 334
4    Eastern and South-Eastern Asia  2 335  2 427  2 411   1 967

In [57]:
pdf_path = "https://github.com/chezou/tabula-py/raw/master/tests/resources/data.pdf"
dfs = tb.read_pdf(pdf_path, stream=True)

'pages' argument isn't specified.Will extract only from page 1 by default.

In [58]:
dfs

[     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear
 0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4
 1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
 2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4
 3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3
 4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3
 5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3
 6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3
 7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4
 8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4
 9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4
 10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4
 11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3
 12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3
 13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3
 14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3
 15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3
 16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3
 17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4
 18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4
 19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4
 20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3
 21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3
 22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3
 23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3
 24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3
 25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4
 26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5
 27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5
 28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5
 29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5
 30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5]

In [27]:
df = pd.DataFrame(np.concatenate(dfs))

In [28]:
df.head

<bound method NDFrame.head of                      0     1  2      3    4     5      6      7  8  9  10 11
0             Mazda RX4  21.0  6  160.0  110   3.9   2.62  16.46  0  1  4  4
1         Mazda RX4 Wag  21.0  6  160.0  110   3.9  2.875  17.02  0  1  4  4
2            Datsun 710  22.8  4  108.0   93  3.85   2.32  18.61  1  1  4  1
3        Hornet 4 Drive  21.4  6  258.0  110  3.08  3.215  19.44  1  0  3  1
4     Hornet Sportabout  18.7  8  360.0  175  3.15   3.44  17.02  0  0  3  2
5               Valiant  18.1  6  225.0  105  2.76   3.46  20.22  1  0  3  1
6            Duster 360  14.3  8  360.0  245  3.21   3.57  15.84  0  0  3  4
7             Merc 240D  24.4  4  146.7   62  3.69   3.19   20.0  1  0  4  2
8              Merc 230  22.8  4  140.8   95  3.92   3.15   22.9  1  0  4  2
9              Merc 280  19.2  6  167.6  123  3.92   3.44   18.3  1  0  4  4
10            Merc 280C  17.8  6  167.6  123  3.92   3.44   18.9  1  0  4  4
11           Merc 450SE  16.4  8  275.8  180  3.07   4.07   17.4  0  0  3  3
12           Merc 450SL  17.3  8  275.8  180  3.07   3.73   17.6  0  0  3  3
13          Merc 450SLC  15.2  8  275.8  180  3.07   3.78   18.0  0  0  3  3
14   Cadillac Fleetwood  10.4  8  472.0  205  2.93   5.25  17.98  0  0  3  4
15  Lincoln Continental  10.4  8  460.0  215   3.0  5.424  17.82  0  0  3  4
16    Chrysler Imperial  14.7  8  440.0  230  3.23  5.345  17.42  0  0  3  4
17             Fiat 128  32.4  4   78.7   66  4.08    2.2  19.47  1  1  4  1
18          Honda Civic  30.4  4   75.7   52  4.93  1.615  18.52  1  1  4  2
19       Toyota Corolla  33.9  4   71.1   65  4.22  1.835   19.9  1  1  4  1
20        Toyota Corona  21.5  4  120.1   97   3.7  2.465  20.01  1  0  3  1
21     Dodge Challenger  15.5  8  318.0  150  2.76   3.52  16.87  0  0  3  2
22          AMC Javelin  15.2  8  304.0  150  3.15  3.435   17.3  0  0  3  2
23           Camaro Z28  13.3  8  350.0  245  3.73   3.84  15.41  0  0  3  4
24     Pontiac Firebird  19.2  8  400.0  175  3.08  3.845  17.05  0  0  3  2
25            Fiat X1-9  27.3  4   79.0   66  4.08  1.935   18.9  1  1  4  1
26        Porsche 914-2  26.0  4  120.3   91  4.43   2.14   16.7  0  1  5  2
27         Lotus Europa  30.4  4   95.1  113  3.77  1.513   16.9  1  1  5  2
28       Ford Pantera L  15.8  8  351.0  264  4.22   3.17   14.5  0  1  5  4
29         Ferrari Dino  19.7  6  145.0  175  3.62   2.77   15.5  0  1  5  6
30        Maserati Bora  15.0  8  301.0  335  3.54   3.57   14.6  0  1  5  8
31           Volvo 142E  21.4  4  121.0  109  4.11   2.78   18.6  1  1  4  2>

In [44]:
dfs = tb.read_pdf(pdf_path, pages="all")
len(dfs)

4

In [45]:
dfs

[     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear
 0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4
 1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
 2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4
 3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3
 4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3
 5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3
 6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3
 7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4
 8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4
 9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4
 10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4
 11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3
 12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3
 13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3
 14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3
 15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3
 16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3
 17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4
 18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4
 19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4
 20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3
 21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3
 22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3
 23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3
 24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3
 25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4
 26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5
 27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5
 28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5
 29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5
 30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5,
    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
 0           5.1          3.5           1.4          0.2  setosa
 1           4.9          3.0           1.4          0.2  setosa
 2           4.7          3.2           1.3          0.2  setosa
 3           4.6          3.1           1.5          0.2  setosa
 4           5.0          3.6           1.4          0.2  setosa
 5           5.4          3.9           1.7          0.4  setosa,
    Unnamed: 0  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
 0         145           6.7          3.3           5.7          2.5  virginica
 1         146           6.7          3.0           5.2          2.3  virginica
 2         147           6.3          2.5           5.0          1.9  virginica
 3         148           6.5          3.0           5.2          2.0  virginica
 4         149           6.2          3.4           5.4          2.3  virginica
 5         150           5.9          3.0           5.1          1.8  virginica,
    supp
 0    VC
 1    VC
 2    VC
 3    VC
 4    VC
 5    VC
 6    VC
 7    VC
 8    VC
 9    VC
 10   VC
 11   VC
 12   VC
 13   VC]

In [47]:
df = list()

for iterador in dfs:
    print(len(iterador))
    print(type(iterador))
    df.append(iterador)
    #df.append(pd.DataFrame(np.concatenate(iterador)))

31
<class 'pandas.core.frame.DataFrame'>
6
<class 'pandas.core.frame.DataFrame'>
6
<class 'pandas.core.frame.DataFrame'>
14
<class 'pandas.core.frame.DataFrame'>

In [55]:
df[3].head()

  supp
0   VC
1   VC
2   VC
3   VC
4   VC

# Opção - PDF Plumber

https://github.com/jsvine/pdfplumber

# By My Own

In [56]:
file =  'http://www.fapeg.go.gov.br/wp-content/uploads/2018/01/CP_01_2018_PARTICIPACAO.pdf'

In [59]:
#data = tb.convert_into(file, 'edital_data.csv', output_format='csv', pages='all')
data = tb.read_pdf(file, pages='all')

In [60]:
type(data)
print(data)

[                                          ATIVIDADES        DATA
0  Lançamento do Edital na página eletrônica da F...  29/01/2018
1  Disponibilização do formulário no sistema FAPE...  01/02/2018
2                   Limite para impugnação do Edital  01/02/2018,                      Unnamed: 0                  Unnamed: 1  \
0             PERÍODO DO EVENTO                   INSCRIÇÃO
1                           NaN                         NaN
2       1 a 30 de abril de 2018                         NaN
3                             e      Até 5 de março de 2018
4        1 a 31 de maio de 2018                         NaN
5       1 a 30 de junho de 2018                         NaN
6                             e     Até 10 de abril de 2018
7       1 a 31 de julho de 2018                         NaN
8      1 a 31 de agosto de 2018      Até 10 de maio de 2018
9    1 a 30 de setembro de 2018     Até 11 de junho de 2018
10    1 a 31 de outubro de 2018     Até 10 de julho de 2018
11   1 a 30 de novembro de 2018    Até 10 de agosto de 2018
12   1 a 31 de dezembro de 2018  Até 10 de setembro de 2018
13    1 a 30 de janeiro de 2018   Até 10 de outubro de 2018
14  1 a 28 de fevereiro de 2018  Até 12 de novembro de 2018
15      1 a 31 de março de 2018  Até 10 de dezembro de 2018

         RESULTADO FINAL A
0                      NaN
1                PARTIR DE
2                      NaN
3      19 de março de 2018
4                      NaN
5                      NaN
6      30 de abril de 2018
7                      NaN
8       30 de maio de 2018
9      29 de junho de 2018
10     30 de julho de 2018
11    30 de agosto de 2018
12  28 de setembro de 2018
13   30 de outubro de 2018
14  30 de novembro de 2018
15  28 de dezembro de 2018  ,                                            CRITÉRIOS   NOTA
0  I – Mérito e relevância científica do trabalho...  1 a 5
1                          II – Produção científica;  1 a 5
2  III - Impacto dos resultados do trabalho a ser...    NaN
3                                                NaN  1 a 5
4  desenvolvimento científico, tecnológico e de i...    NaN
5  IV - Participação do proponente em programas d...    NaN
6                                                NaN  1 a 5
7                                      stricto sensu    NaN]

In [69]:
df = list()

for iterador in data:
    print(len(iterador))
    print(type(iterador))
    print(iterador)
    
    df.append(iterador)

3
<class 'pandas.core.frame.DataFrame'>
                                          ATIVIDADES        DATA
0  Lançamento do Edital na página eletrônica da F...  29/01/2018
1  Disponibilização do formulário no sistema FAPE...  01/02/2018
2                   Limite para impugnação do Edital  01/02/2018
16
<class 'pandas.core.frame.DataFrame'>
                     Unnamed: 0                  Unnamed: 1  \
0             PERÍODO DO EVENTO                   INSCRIÇÃO
1                           NaN                         NaN
2       1 a 30 de abril de 2018                         NaN
3                             e      Até 5 de março de 2018
4        1 a 31 de maio de 2018                         NaN
5       1 a 30 de junho de 2018                         NaN
6                             e     Até 10 de abril de 2018
7       1 a 31 de julho de 2018                         NaN
8      1 a 31 de agosto de 2018      Até 10 de maio de 2018
9    1 a 30 de setembro de 2018     Até 11 de junho de 2018
10    1 a 31 de outubro de 2018     Até 10 de julho de 2018
11   1 a 30 de novembro de 2018    Até 10 de agosto de 2018
12   1 a 31 de dezembro de 2018  Até 10 de setembro de 2018
13    1 a 30 de janeiro de 2018   Até 10 de outubro de 2018
14  1 a 28 de fevereiro de 2018  Até 12 de novembro de 2018
15      1 a 31 de março de 2018  Até 10 de dezembro de 2018

         RESULTADO FINAL A
0                      NaN
1                PARTIR DE
2                      NaN
3      19 de março de 2018
4                      NaN
5                      NaN
6      30 de abril de 2018
7                      NaN
8       30 de maio de 2018
9      29 de junho de 2018
10     30 de julho de 2018
11    30 de agosto de 2018
12  28 de setembro de 2018
13   30 de outubro de 2018
14  30 de novembro de 2018
15  28 de dezembro de 2018
8
<class 'pandas.core.frame.DataFrame'>
                                           CRITÉRIOS   NOTA
0  I – Mérito e relevância científica do trabalho...  1 a 5
1                          II – Produção científica;  1 a 5
2  III - Impacto dos resultados do trabalho a ser...    NaN
3                                                NaN  1 a 5
4  desenvolvimento científico, tecnológico e de i...    NaN
5  IV - Participação do proponente em programas d...    NaN
6                                                NaN  1 a 5
7                                      stricto sensu    NaN

In [72]:
df[0].head()

                                          ATIVIDADES        DATA
0  Lançamento do Edital na página eletrônica da F...  29/01/2018
1  Disponibilização do formulário no sistema FAPE...  01/02/2018
2                   Limite para impugnação do Edital  01/02/2018

In [71]:
df[1].head()

                Unnamed: 0              Unnamed: 1    RESULTADO FINAL A
0        PERÍODO DO EVENTO               INSCRIÇÃO                  NaN
1                      NaN                     NaN            PARTIR DE
2  1 a 30 de abril de 2018                     NaN                  NaN
3                        e  Até 5 de março de 2018  19 de março de 2018
4   1 a 31 de maio de 2018                     NaN                  NaN

In [73]:
df[2].head()

                                           CRITÉRIOS   NOTA
0  I – Mérito e relevância científica do trabalho...  1 a 5
1                          II – Produção científica;  1 a 5
2  III - Impacto dos resultados do trabalho a ser...    NaN
3                                                NaN  1 a 5
4  desenvolvimento científico, tecnológico e de i...    NaN

In [50]:
df = pd.DataFrame(np.concatenate(data))

ValueError: all the input array dimensions for the concatenation axis must match exactly, but along dimension 1, the array at index 0 has size 2 and the array at index 1 has size 3

In [40]:
df.head()

                                                   0
0                                            ATIV...
1                       Unnamed: 0               ...